{
  "Asma" : [ 
    {
    "name": "ٱلْرَّحْمَـانُ",
    "count": 100,
    "desc_ur": "ہر فرض نماز کے بعد 100 مرتبہ پڑھنے سے حافظہ اور شعور میں اضافہ ہوگا۔ تلاوت کرنے والا اپنے دل سے بوجھ ہٹتا ہوا محسوس کرے گا۔",
    "desc_en": "Reciting it 100 times after every obligatory prayer increases memory and awareness. The reciter will feel a burden lifted from his heart."
  },
    {
      "name": "ٱلْرَّحِيْمُ",
      "count": 100,
      "desc_ur": "فجر کی نماز کے بعد 100 مرتبہ پڑھنے سے انسان تمام فتنوں سے محفوظ رہے گا۔ مزید یہ کہ وہ ہر ایک کو اپنے لیے مہربان پائے گا",
      "desc_en": "Reciting it 100 times after Fajr prayer will protect a person from all trials. Additionally, he will find everyone kind to him."
    },
    {
      "name": "ٱلْمَلِكُ",
      "count": 120,
      "desc_ur": "فجر کی نماز کے بعد اس اسم کا ورد کرنے سے آدمی مالدار ہو جائے گا۔",
      "desc_en": "Reciting this name after Fajr prayer will make a person wealthy."
    },
    {
      "name": "ٱلْقُدُّوسُ",
      "count": 100,
      "desc_ur": "اگر کوئی اسے روزانہ 100 مرتبہ پڑھے تو غصہ کبھی قریب نہیں آتا۔",
      "desc_en": "If someone recites it 100 times daily, anger will never come near him."
    },
    {
      "name": " ٱلْسَّلَامُ",
      "count": 161,
      "desc_ur": "بیمار کی صحت بحال ہو جائے گی اگر اسے 160 مرتبہ پڑھا جائے۔ اس اسم کو کثرت سے پڑھنے والے کو بھی ہر قسم کے فتنوں سے محفوظ رکھتا ہے۔",
      "desc_en": "A sick person's health will be restored if this is recited 160 times. It also protects the reciter from all kinds of trials."
    },
    {
      "name": "ٱلْمُؤْمِنُ",
      "count": 136,
      "desc_ur": "اس کو 136 مرتبہ پڑھنے سے آپ غم سے محفوظ رہیں گے۔",
      "desc_en": "Reciting it 136 times will protect you from sorrow."
    },
    {
      "name": "ٱلْمُهَيْمِنُ",
      "count": 100,
      "desc_ur": "یہ انسان کی روح کو پاک کرتا ہے، اگر اسے غسل کرنے اور دو رکعت نماز پڑھنے کے بعد 100 مرتبہ پڑھا جائے۔",
      "desc_en": "It purifies the soul if recited 100 times after taking a bath and performing two rakats of prayer."
    },
    {
      "name": " ٱلْعَزِيزُ",
      "count": 41,
      "desc_ur": "فجر کی نماز کے بعد 41 مرتبہ اس اسم کو پڑھنے سے انسان دوسروں سے بے نیاز ہو جائے گا اور عزت پائے گا۔",
      "desc_en": "Reciting this name 41 times after Fajr prayer will make a person independent of others and gain respect."
    },
    {
      "name": "ٱلْجَبَّارُ",
      "count": 226,
      "desc_ur": "جو اس اسم کو کئی بار پڑھے گا وہ کسی چیز پر مجبور نہیں ہوگا۔ وہ ظلم اور مشقت سے محفوظ رہے گا۔",
      "desc_en": "Whoever recites this name many times will not be compelled by anything. He will be protected from oppression and hardship."
    },
    {
      "name": "ٱلْمُتَكَبِّرُ",
      "count": 41,
      "desc_ur": "جو اس اسم کو کثرت سے پڑھے گا وہ عزت اور کامیابی حاصل کرے گا۔",
      "desc_en": "Whoever recites this name frequently will gain respect and success."
    },
    {
      "name": "ٱلْخَالِقُ",
      "count": 100,
      "desc_ur": "اگر وہ اس اسم کو 7 دن کی مقررہ حد تک 100 مرتبہ مسلسل پڑھے تو اللہ تعالیٰ اس شخص کی راہنمائی کے لیے ایک فرشتہ مقرر کرے گا۔",
      "desc_en": "If recited 100 times continuously for 7 days, Allah will appoint an angel to guide that person."
    },
    {
      "name": "ٱلْبَارِئُ",
      "count": 100,
      "desc_ur": "یہ نام اس بات کی طرف اشارہ کرتا ہے کہ اللہ نے ہر چیز کو تناسب کے ساتھ پیدا کیا ہے۔",
      "desc_en": "This name indicates that Allah has created everything with proportion."
    },
    {
      "name": "ٱلْمُصَوِّرُ",
      "count": 21,
      "desc_ur": "اس اسم کو 21 مرتبہ پڑھیں اور پانی پر دم کریں۔ یہ عمل مسلسل 7 دن تک جاری رکھیں۔ افطاری کے لیے پانی استعمال کریں۔ ان شاء اللہ، خواتین کو جلد ہی بچہ نصیب ہوگا۔",
      "desc_en": "Recite this name 21 times and blow on water. Continue this practice for 7 days. Use the water for Iftar. Insha'Allah, women will soon conceive."
    },
    {
      "name": "ٱلْغَفَّارُ",
      "count": 100,
      "desc_ur": "کثرت سے پڑھنے سے انسان کے گناہ معاف ہو جاتے ہیں۔",
      "desc_en": "Frequent recitation leads to the forgiveness of sins."
    },
    {
      "name": "ٱلْقَهَّارُ",
      "count": 100,
      "desc_ur": "یہ نام انسان کو اندرونی سکون فراہم کرے گا اور انسان کو صحیح مقام تک لے جائے گا۔",
      "desc_en": "This name provides inner peace and leads a person to the right position."
    },
    {
      "name": "ٱلْوَهَّابُ",
      "count": 400,
      "desc_ur": "کثرت سے پڑھنے سے غربت دور ہو جاتی ہے۔ چاشت کی نماز کے آخری سجدے میں چالیس مرتبہ پڑھنے سے بھوک سے نجات مل جاتی ہے۔",
      "desc_en": "Frequent recitation removes poverty. Reciting it forty times in the last prostration of Duha prayer alleviates hunger."
    },
    {
      "name": "ٱلْرَّزَّاقُ",
      "count": 41,
      "desc_ur": "اس اسم کے پڑھنے سے روزی ملے گی۔",
      "desc_en": "Reciting this name will bring sustenance."
    },
    {
      "name": "ٱلْفَتَّاحُ",
      "count": 71,
      "desc_ur": "اس اسم کا ورد کرنے والے کو زندگی کے ہر شعبے میں کامیابی اور فتح نصیب ہوگی۔",
      "desc_en": "The one who recites this name will achieve success and victory in all areas of life."
    },
    {
      "name": "ٱلْعَلِيمُ",
      "count": 150,
      "desc_ur": "تلاوت کرنے والے کا دل نور کے نور سے منور ہو گا۔",
      "desc_en": "The reciter's heart will be illuminated with divine light."
    },
    {
      "name": "ٱلْقَابِضُ",
      "count": 40,
      "desc_ur": "اس سے گھر سے غربت ختم ہو جاتی ہے اگر یہ لکھا جائے اور 4 ٹکڑوں پر 40 دن تک کھایا جائے۔",
      "desc_en": "Poverty will be eradicated from the house if this is written and eaten in 4 pieces for 40 days."
    },
    {
      "name": "ٱلْبَاسِطُ",
      "count": 10,
      "desc_ur": "چاشت کی نماز کے بعد 10 مرتبہ اس اسم کو پڑھنے اور چہرے پر ہاتھ رگڑنے سے اب دوسروں پر انحصار نہیں ہوگا۔",
      "desc_en": "After Duha prayer, recite this name 10 times and rub your hands over your face, and you will no longer depend on others."
    },
    {
      "name": "ٱلْخَافِضُ",
      "count": 500,
      "desc_ur": "500 مرتبہ پڑھنے والے کی حاجت اللہ پوری کرے گا۔ یہ تمام دشمنوں سے حفاظت کا کام بھی کرتا ہے اگر روزے کے چوتھے دن لوگوں کی ایک جماعت مجلس میں بیٹھ کر اس اسم کو 70 مرتبہ پڑھے۔",
      "desc_en": "Allah will fulfill the need of one who recites it 500 times. It also protects from all enemies if a group of people recite it 70 times in a gathering on the fourth day of fasting."
    },
    {
      "name": "ٱلْرَّافِعُ",
      "count": 101,
      "desc_ur": "جو اس اسم کو دن رات 101 مرتبہ پڑھے گا وہ دولت مند ہو جائے گا اور خوبیوں میں بلند ہو گا۔",
      "desc_en": "Whoever recites this name 101 times day and night will become wealthy and elevated in virtues."
    },
    {
      "name": "ٱلْمُعِزُّ",
      "count": 140,
      "desc_ur": "سوموار یا جمعہ کے دن مغرب کی نماز کے بعد 140 مرتبہ اس اسم کو پڑھنے سے اللہ تعالیٰ اسے لوگوں کی نظروں میں بزرگ بنا دے گا۔",
      "desc_en": "Reciting this name 140 times after Maghrib prayer on Monday or Friday will make Allah exalt the person in the eyes of people."
    },
    {
      "name": "ٱلْمُذِلُّ",
      "count": 75,
      "desc_ur": "اس اسم کو 75 مرتبہ پڑھنے سے انسان ان لوگوں سے محفوظ رہے گا جو اسے نقصان پہنچانا چاہتے ہیں۔",
      "desc_en": "Reciting this name 75 times will protect a person from those who wish to harm him."
    },
    {
      "name": "ٱلْسَّمِيعُ",
      "count": 500,
      "desc_ur": "جو شخص جمعرات کو نماز چاشت کے بعد اس اسم کو 500، 100 یا 50 مرتبہ پڑھے گا اللہ تعالیٰ اس کی خواہش پوری کرے گا۔",
      "desc_en": "Whoever recites this name 500, 100, or 50 times after Duha prayer on Thursday, Allah will fulfill his desire."
    },
    {
      "name": "ٱلْبَصِيرُ",
      "count": 100,
      "desc_ur": "دل اور روح کی فرحت کے لیے اس اسم کو نماز جمعہ کے بعد 100 مرتبہ پڑھیں۔",
      "desc_en": "Recite this name 100 times after Friday prayer for the joy of heart and soul."
    },
    {
      "name": "ٱلْحَكَمُ",
      "count": 99,
      "desc_ur": "جو شخص رات کو کثرت سے اس اسم کا ورد کرے گا اس کے راز کھل جائیں گے۔",
      "desc_en": "The person who frequently recites this name at night will have his secrets revealed."
    },
    {
      "name": "ٱلْعَدْلُ",
      "count": 80,
      "desc_ur": "جمعہ کے دن روٹی کے ٹکڑے پر یہ نام لکھو گے تو لوگ تمہاری بات مانیں گے۔",
      "desc_en": "Write this name on a piece of bread on Friday, and people will heed your words."
    },
    {
      "name": "ٱلْلَّطِيفُ",
      "count": 133,
      "desc_ur": "اپنے معاملات کو اپنی مرضی کے مطابق طے کرنے کے لیے روزانہ 133 مرتبہ اس اسم کا ورد کریں۔",
      "desc_en": "Recite this name 133 times daily to have your matters settled according to your wishes."
    },
    {
      "name": "ٱلْخَبِيرُ",
      "count": 300,
      "desc_ur": "اس اسم کو باقاعدگی سے پڑھنے سے غلط کام کرنے والا نیک آدمی بن جاتا ہے۔",
      "desc_en": "Regular recitation of this name transforms a wrongdoer into a righteous person."
    },
    {
      "name": "ٱلْحَلِيمُ",
      "count": 28,
      "desc_ur": "اس نام کو کاغذ پر لکھ کر پانی سے دھو لیں۔ اس پانی کو چھڑکنے کے لیے استعمال کریں۔ اس سے چیزیں ہر قسم کے نقصانات سے محفوظ رہیں گی۔",
      "desc_en": "Write this name on paper and wash it with water. Use this water to sprinkle for protection from all types of harm."
    },
    {
      "name": "ٱلْعَظِيمُ",
      "count": 12,
      "desc_ur": "عزت و تکریم حاصل کرنے کے لیے اس اسم کو کئی بار پڑھیں۔",
      "desc_en": "Recite this name multiple times to gain respect and honor."
    },
    {
      "name": "ٱلْغَفُورُ",
      "count": 41,
      "desc_ur": "یہ نام سر درد اور بخار کے علاج کا کام کرتا ہے۔",
      "desc_en": "This name is a remedy for headaches and fever."
    },
    {
      "name": "ٱلْشَّكُورُ",
      "count": 41,
      "desc_ur": "اس اسم کو روزانہ 41 مرتبہ پڑھے تو تمام مصائب سے نجات مل جائے گی۔",
      "desc_en": "Reciting this name 41 times daily will relieve all troubles."
    },
    {
      "name": "ٱلْعَلِيُّ",
      "count": 100,
      "desc_ur": "اس اسم کو کاغذ پر لکھ کر رکھنے والا اپنے تمام کاموں میں اعلیٰ مقام اور کامیابی حاصل کرے گا۔",
      "desc_en": "Writing this name on paper and keeping it will bring high status and success in all tasks."
    },
    {
      "name": "ٱلْكَبِيرُ",
      "count": 100,
      "desc_ur": "روزانہ 100 مرتبہ اس اسم کا ورد کرنے والا ہر شخص قابل قدر ہوگا۔",
      "desc_en": "The one who recites this name 100 times daily will be esteemed by everyone."
    },
    {
      "name": "ٱلْحَفِيظُ",
      "count": 16,
      "desc_ur": "اس اسم کا ورد کریں اور پانی پر ڈیم کریں۔ بیمار بچے کو پانی پلائیں۔ وہ فرمانبردار ہو جائے گا۔",
      "desc_en": "Recite this name and blow on water. Give the water to a sick child to drink, and they will become obedient."
    },
    {
      "name": "ٱلْمُقِيتُ",
      "count": 7,
      "desc_ur": "اسماء الحسنہ کے اس خوبصورت اسم کو کثرت سے پڑھنے سے وہ پریشانیوں اور مشکلات سے محفوظ رہے گا۔",
      "desc_en": "Frequent recitation of this beautiful name from Asmaul Husna will protect one from worries and difficulties."
    },
    {
      "name": "ٱلْحَسِيبُ",
      "count": 7,
      "desc_ur": "جو شخص اس اسم کو 7 مرتبہ پڑھے اور اپنے اوپر دام کرے اس کا مال اور اہل و عیال اللہ کی حفاظت میں آجائیں گے۔",
      "desc_en": "Whoever recites this name 7 times and blows over themselves will have their wealth and family protected by Allah."
    },
    {
      "name": "ٱلْجَلِيلُ",
      "count": 73,
      "desc_ur": "اس اسم کو کثرت سے دہرانے سے انسان کو عزت و تکریم حاصل کرنے میں مدد ملے گی۔",
      "desc_en": "Repeated recitation of this name will help in gaining respect and honor."
    },
    {
      "name": "ٱلْكَرِيمُ",
      "count": 50,
      "desc_ur": "دنیا اور آخرت میں عزت کمانے کے لیے سونے سے پہلے اس اسم کو کئی بار پڑھیں۔",
      "desc_en": "Recite this name several times before sleeping to gain honor in this world and the hereafter."
    },
    {
      "name": "ٱلْرَّقِيبُ",
      "count": 7,
      "desc_ur": "اس اسم کو سات مرتبہ پڑھیں اور اپنے یا اپنے گھر والوں پر دام کریں۔ یہ اللہ کی حفاظت میں حفاظت کو یقینی بنائے گا۔",
      "desc_en": "Recite this name seven times and blow over yourself or your family to ensure protection by Allah."
    },
    {
      "name": "ٱلْمُجِيبُ",
      "count": 3,
      "desc_ur": "اگر آپ اپنی کسی اپیل کا جواب چاہتے ہیں تو اس اسم کو کثرت سے پڑھیں گے تو آپ کو مل جائے گا۔",
      "desc_en": "If you seek a response to your appeal, frequent recitation of this name will fulfill it."
    },
    {
      "name": "ٱلْوَاسِعُ",
      "count": 41,
      "desc_ur": "اگر کوئی اس اسم کو کثرت سے پڑھے تو اللہ تعالیٰ آمدنی کے دروازے کھول دیتا ہے۔ اس کی کمائی کی مشکلات دور ہو جائیں۔",
      "desc_en": "Frequent recitation of this name will open doors of income and resolve financial difficulties."
    },
    {
      "name": "ٱلْحَكِيمُ",
      "count": 72,
      "desc_ur": "اس اسم کو پڑھنے سے کام کی مشکلات دور ہو جاتی ہیں۔",
      "desc_en": "Reciting this name will alleviate difficulties in work."
    },
    {
      "name": "ٱلْوَدُودُ",
      "count": 1000,
      "desc_ur": "اگر کوئی شخص اپنے کھانے میں اس اسم کو 1000 مرتبہ پڑھنے کے بعد دوسرے کو کھانا دے تو یہ اسم دو افراد کے درمیان اختلاف کو دور کرنے میں مدد کرتا ہے۔",
      "desc_en": "Reciting this name 1000 times while preparing food will help resolve disputes between two individuals when the food is shared."
    },
    {
      "name": "ٱلْمَجِيدُ",
      "count": 97,
      "desc_ur": "یہ نام ایک شخص کو جلال بخشتا ہے۔",
      "desc_en": "This name grants a person majesty."
    },
    {
      "name": "ٱلْبَاعِثُ",
      "count": 100,
      "desc_ur": "یہ نام انسان کو خدا سے ڈرنے والا بناتا ہے اور اسی لیے اسے راہ راست پر لے جاتا ہے۔",
      "desc_en": "This name makes a person fearful of God and thus guides them to the right path."
    },
    {
      "name": "ٱلْشَّهِيدُ",
      "count": 41,
      "desc_ur": "نافرمان کے سر پر ہاتھ رکھ کر 21 مرتبہ اس اسم کو پڑھیں۔ انشاء اللہ وہ فرمانبردار ہو جائے گا۔",
      "desc_en": "Recite this name 21 times while placing your hand on the disobedient person's head. Insha'Allah, they will become obedient."
    },
    {
      "name": "ٱلْحَقُّ",
      "count": 199,
      "desc_ur": "اگر کوئی چیز کھو جائے تو یہ اسم پڑھیں۔",
      "desc_en": "Recite this name if something is lost."
    },
    {
      "name": "ٱلْوَكِيلُ",
      "count": 196,
      "desc_ur": "اگر اس اسم کو کثرت سے پڑھے تو اللہ تعالیٰ اس شخص کو ڈوبنے یا آگ میں جلنے سے محفوظ رکھے گا۔",
      "desc_en": "Frequent recitation of this name will protect a person from drowning or burning in fire."
    },
    {
      "name": "ٱلْقَوِيُّ",
      "count": 1000,
      "desc_ur": "اس سے آدمی دشمن کے نقصان سے محفوظ رہتا ہے اگر وہ دشمن کو شکست نہ دے سکے۔",
      "desc_en": "Recitation of this name will protect a person from harm by the enemy if they cannot defeat them."
    },
    {
      "name": "ٱلْمَتِينُ",
      "count": 10,
      "desc_ur": "اس سے انسان کو ہر قسم کی پریشانیوں سے نجات ملتی ہے۔",
      "desc_en": "Recitation of this name provides relief from all kinds of troubles."
    },
    {
      "name": "ٱلْوَلِيُّ",
      "count": 1000,
      "desc_ur": "اس اسم کو پڑھنے سے انسان اللہ کے قریب ہو جاتا ہے۔",
      "desc_en": "Reciting this name brings a person closer to Allah."
    },
    {
      "name": "ٱلْحَمِيدُ",
      "count": 93,
      "desc_ur": "جو اس اسم کو پڑھے گا اس کی تعریف اور محبت کی جائے گی۔",
      "desc_en": "Whoever recites this name will be praised and loved."
    },
    {
      "name": "ٱلْمُحْصِيُ",
      "count": 1000,
      "desc_ur": "اگر قیامت کے دن اس سے سوال ہونے کا ڈر ہو تو یہ اسم اس کے لیے آسانی فراہم کرتا ہے۔",
      "desc_en": "If there is fear of being questioned on the Day of Judgment, this name provides ease."
    },
    {
      "name": "ٱلْمُبْدِئُ",
      "count": 90,
      "desc_ur": "حاملہ عورت اس اسم کو کئی بار دہرائے تو اسقاط حمل کے وقت خطرے سے محفوظ رہے گی۔",
      "desc_en": "A pregnant woman who recites this name several times will be protected from miscarriage."
    },
    {
      "name": "ٱلْمُعِيدُ",
      "count": 70,
      "desc_ur": "اس اسم کو 70 مرتبہ پڑھنے سے 7 دن کے اندر گھر سے نکلنے والا محفوظ و مامون ہو جائے گا۔",
      "desc_en": "Reciting this name 70 times will ensure safety and protection for anyone leaving the house within 7 days."
    },
    {
      "name": "ٱلْمُحْيِى",
      "count": 89,
      "desc_ur": "اس اسم کو روزانہ 7 مرتبہ پڑھنے سے انسان کا بوجھ کم ہو جاتا ہے۔",
      "desc_en": "Reciting this name 7 times daily will lighten a person's burden."
    },
    {
      "name": "ٱلْمُمِيتُ",
      "count": 7,
      "desc_ur": "یہ نام دشمن کو مکمل طور پر تباہ کر دیتا ہے۔",
      "desc_en": "This name completely destroys the enemy."
    },
    {
      "name": "ٱلْحَىُّ",
      "count": 3,
      "desc_ur": "اس اسم کو پڑھنے والے کی عمر دراز ہو گی۔",
      "desc_en": "Reciting this name will prolong the life of the reciter."
    },
    {
      "name": "ٱلْقَيُّومُ",
      "count": 70,
      "desc_ur": "جو اس نام کو دہرائے گا وہ متحرک رہے گا۔",
      "desc_en": "Reciting this name will keep the person active."
    },
    {
      "name": "ٱلْوَاجِدُ",
      "count": 100,
      "desc_ur": "یہ نام دل کی دولت کو بڑھاتا ہے۔",
      "desc_en": "This name increases the wealth of the heart."
    },
    {
      "name": "ٱلْمَاجِدُ",
      "count": 10,
      "desc_ur": "یہ نام اس کے پڑھنے والے کے دل کو منور کرتا ہے۔",
      "desc_en": "This name illuminates the heart of the reciter."
    },
    {
      "name": "ٱلْوَاحِدُ",
      "count": 1000,
      "desc_ur": "اس اسم کو 1000 مرتبہ خاموشی سے پڑھنے سے دل کا خوف ختم ہو جائے گا۔",
      "desc_en": "Reciting this name 1000 times in silence will eliminate the fear of the heart."
    },
    {
      "name": "ٱلْأَحَد",
      "count": 1000,
      "desc_ur": "اس اسم کو 1000 مرتبہ پڑھنے والے کے راز کھل جائیں گے۔",
      "desc_en": "Reciting this name 1000 times will reveal the secrets of the reciter."
    },
    {
      "name": "ٱلْصَّمَدُ",
      "count": 150,
      "desc_ur": "جو شخص اس اسم کو کثرت سے پڑھے گا اللہ اس کی تمام حاجتیں پوری کرے گا۔",
      "desc_en": "Whoever recites this name frequently, Allah will fulfill all their needs."
    },
    {
      "name": "ٱلْقَادِرُ",
      "count": 41,
      "desc_ur": "جو شخص اس اسم کو کثرت سے پڑھتا ہے اللہ اس کی تمام خواہشات پوری کرتا ہے۔",
      "desc_en": "Whoever recites this name frequently, Allah will fulfill all their desires."
    },
    {
      "name": "ٱلْمُقْتَدِرُ",
      "count": 20,
      "desc_ur": "اسماء الحسنہ کے اس خوبصورت نام کا ورد کرنے والا حقیقت سے آشنا ہو جائے گا۔",
      "desc_en": "Reciting this beautiful name of Asma-ul-Husna will make the reciter acquainted with the truth."
    },
    {
      "name": "ٱلْمُقَدِّمُ",
      "count": 9,
      "desc_ur": "میدان جنگ میں اس اسم کا ورد کرنے سے تمام خوف دور ہو جاتا ہے اور انسان نقصان سے محفوظ رہتا ہے۔",
      "desc_en": "Reciting this name in the battlefield will dispel all fears and protect the person from harm."
    },
    {
      "name": "ٱلْمُؤَخِّرُ",
      "count": 100,
      "desc_ur": "اس اسم کو 100 مرتبہ دل میں پڑھنے سے انسان کے دل کو اللہ کی محبت سے مالا مال ہو جاتا ہے۔ اس کی تمام دنیاوی خواہشات ختم ہو جائیں گی کیونکہ اس کے دل کی جگہ کوئی دوسری محبت کبھی نہیں لے گی۔",
      "desc_en": "Reciting this name 100 times in the heart will fill the heart with Allah's love. All worldly desires will vanish as no other love will ever replace it."
    },
    {
      "name": "ٱلأَوَّلُ",
      "count": 1000,
      "desc_ur": "40 دن تک 40 مرتبہ پڑھا جائے تو اس سے ایسے گھرانے میں اولاد ہو جائے گی جس میں ایک بھی برکت نہیں ہے۔ مزید یہ کہ اگر مسافر جمعہ کے دن اس اسم کو 1000 مرتبہ پڑھے گا تو وہ صحیح سلامت گھر پہنچ جائے گا۔",
      "desc_en": "Reciting this name 40 times daily for 40 days will bring offspring to a family lacking blessings. Additionally, a traveler who recites this name 1000 times on Friday will reach home safely."
    },
    {
      "name": "ٱلْآخِرُ",
      "count": 100,
      "desc_ur": "اس اسم کو پڑھنے والے کو اچھی زندگی اور اچھی موت نصیب ہوگی۔",
      "desc_en": "Reciting this name will grant the reciter a good life and a good death."
    },
    {
      "name": "ٱلْظَّاهِرُ",
      "count": 15,
      "desc_ur": "جمعہ کے دن نماز جمعہ کے بعد اس اسم کو 15 مرتبہ پڑھا جائے تو پڑھنے والے کا دل نور سے منور ہو جائے گا۔",
      "desc_en": "Reciting this name 15 times after Friday prayers will illuminate the reciter's heart with light."
    },
    {
      "name": "ٱلْبَاطِنُ",
      "count": 33,
      "desc_ur": "اس اسم کو روزانہ صرف تین بار پڑھنے سے ہر چیز کی حقیقت معلوم ہو جائے گی۔",
      "desc_en": "Reciting this name three times daily will reveal the truth of all things."
    },
    {
      "name": "ٱلْوَالِي",
      "count": 300,
      "desc_ur": "یہ اسم گھر کو تمام خطرات سے محفوظ رکھتا ہے۔",
      "desc_en": "This name protects the home from all dangers."
    },
    {
      "name": "ٱلْمُتَعَالِي",
      "count": 1000,
      "desc_ur": "جو اس اسم کو پڑھے گا وہ اللہ کے قریب ہو جائے گا۔",
      "desc_en": "Whoever recites this name will become closer to Allah."
    },
    {
      "name": "ٱلْبَرُّ",
      "count": 7,
      "desc_ur": "یہ نام پڑھنے والے کے بچے کا مستقبل بدبختی سے پاک کر دے گا۔",
      "desc_en": "Reciting this name will purify the child's future from misfortune."
    },
    {
      "name": "ٱلْتَّوَّابُ",
      "count": 360,
      "desc_ur": "یہ نام پڑھنے والے کے بچے کا مستقبل بدبختی سے پاک کر دے گا۔",
      "desc_en": "Reciting this name will purify the child's future from misfortune."
    },
    {
      "name": "ٱلْمُنْتَقِمُ",
      "count": 1000,
      "desc_ur": "اس سے دشمنوں کے خلاف فتح حاصل کرنے میں مدد ملتی ہے۔",
      "desc_en": "This name helps in gaining victory over enemies."
    },
    {
      "name": "ٱلْعَفُوُّ",
      "count": 100,
      "desc_ur": "یہ نام انسان کے تمام گناہوں کی معافی میں مدد کرتا ہے۔",
      "desc_en": "This name assists in the forgiveness of all sins."
    },
    {
      "name": "ٱلْرَّؤُفُ",
      "count": 10,
      "desc_ur": "اس اسم کو کثرت سے پڑھنے والے کو اللہ تعالیٰ برکت دیتا ہے。",
      "desc_en": "Reciting this name frequently will grant blessings from Allah."
    },
    {
      "name": "مَالِكُ ٱلْمُلْكُ",
      "count": 41,
      "desc_ur": "یہ نام لوگوں میں اپنے پڑھنے والے کو عزت دیتا ہے۔",
      "desc_en": "This name gives respect to its reciter among people."
    },
    {
      "name": "ذُو ٱلْجَلَالِ وَٱلْإِكْرَامُ",
      "count": 333,
      "desc_ur": "یہ اسم غربت کو دور کرتا ہے اور انسان کو امیر بناتا ہے۔",
      "desc_en": "This name removes poverty and makes a person wealthy."
    },
    {
      "name": "ٱلْمُقْسِطُ",
      "count": 7,
      "desc_ur": "یہ نام شیطان کے نقصان سے تحفظ فراہم کرتا ہے۔",
      "desc_en": "This name provides protection from the harm of Satan."
    },
    {
      "name": "ٱلْجَامِعُ",
      "count": 10,
      "desc_ur": "اس نام کی طاقت اور جلال سے آپ کھوئی ہوئی چیزیں تلاش کر سکیں گے۔",
      "desc_en": "The power and glory of this name help you find lost things."
    },
    {
      "name": "ٱلْغَنيُّ",
      "count": 70,
      "desc_ur": "اسماء الحسنہ کے اس خوبصورت اسم کو کم از کم 70 مرتبہ پڑھنے سے انسان تمام حاجات سے پاک ہو جائے گا۔",
      "desc_en": "Reciting this beautiful name at least 70 times will free a person from all needs."
    },
    {
      "name": "ٱلْمُغْنِيُّ",
      "count": 1000,
      "desc_ur": "اس اسم کو 1000 مرتبہ لگاتار دس جمعہ پڑھنے سے انسان خود کفیل ہو جائے گا۔",
      "desc_en": "Reciting this name 1000 times continuously for ten Fridays will make a person self-sufficient."
    },
    {
      "name": "ٱلْمَانِعُ",
      "count": 20,
      "desc_ur": "سوتے وقت اس اسم کو 20 مرتبہ پڑھنے سے خاندانی زندگی خوشگوار رہتی ہے۔",
      "desc_en": "Reciting this name 20 times before sleeping ensures a happy family life."
    },
    {
      "name": "ٱلْضَّارُ",
      "count": 20,
      "desc_ur": "اس اسم کو جمعہ کی رات 20 مرتبہ پڑھنے سے سکون ملتا ہے۔",
      "desc_en": "Reciting this name 20 times on Friday night brings peace."
    },
    {
      "name": "ٱلْنَّافِعُ",
      "count": 41,
      "desc_ur": "اس اسم کو 41 مرتبہ پڑھنے سے ہر نیک کام میں کامیابی ملتی ہے۔",
      "desc_en": "Reciting this name 41 times leads to success in every good deed."
    },
    {
      "name": "ٱلْنُّورُ",
      "count": 1000,
      "desc_ur": "یہ نام انسان کے اندر کو روشن کرتا ہے۔",
      "desc_en": "This name illuminates the inner self of a person."
    },
    {
      "name": "ٱلْهَادِي",
      "count": 1100,
      "desc_ur": "اس اسم کو 1100 مرتبہ پڑھنے سے انسان کی حاجت پوری ہو جاتی ہے۔",
      "desc_en": "Reciting this name 1100 times fulfills a person's needs."
    },
    {
      "name": "ٱلْبَدِيعُ",
      "count": 1000,
      "desc_ur": "ہر قسم کی پریشانی سے نجات کے لیے اس اسم کو ستر ہزار مرتبہ پڑھنا چاہیے۔",
      "desc_en": "To be relieved from every kind of trouble, this name should be recited 70,000 times."
    },
    {
      "name": "ٱلْبَاقِي",
      "count": 100,
      "desc_ur": "اسماء الحسنہ میں موجود یہ خوبصورت نام آپ کے تمام نیک اعمال کی قبولیت کو یقینی بناتا ہے، ہر جمعہ کی رات اس اسم کو 100 مرتبہ پڑھیں۔",
      "desc_en": "This beautiful name among Asmaul Husna ensures the acceptance of all your good deeds. Recite it 100 times every Friday night."
    },
    {
      "name": "ٱلْوَارِثُ",
      "count": 100,
      "desc_ur": "جو شخص طلوع آفتاب کے بعد اس اسم کو 100 مرتبہ پڑھے تو غم و پریشانی سے محفوظ رہے گا۔",
      "desc_en": "Reciting this name 100 times after sunrise protects a person from grief and worries."
    },
    {
      "name": "ٱلْرَّشِيدُ",
      "count": 1000,
      "desc_ur": "جس کام کو کرنے سے قاصر ہوں اس کے لیے مغرب اور عشاء کی نماز کے درمیان اس اسم کو 1000 مرتبہ پڑھیں۔",
      "desc_en": "To accomplish a task you are unable to do, recite this name 1000 times between Maghrib and Isha prayers."
    },
    {
      "name": "ٱلْصَّبُورُ",
      "count": 3000,
      "desc_ur": "اس اسم کو 3000 مرتبہ پڑھے تو اس کی مشکل سے نجات مل جائے گی۔",
      "desc_en": "Reciting this name 3000 times will relieve you from difficulties."
    }

  ],
  "Muhammad" : [
    {
      "name": "مُحَمَّدٌ",
      "count": 100,
      "desc_ur": "اس نام کا ورد دل کو سکون اور رحمت الہی عطا کرتا ہے۔",
      "desc_en": "Reciting this name brings peace and Allah's mercy to the heart."
    },
    {
      "name": "أَحْمَدُ",
      "count": 90,
      "desc_ur": "اس نام کی تلاوت اللہ کی تعریف کا باعث بنتی ہے۔",
      "desc_en": "Reciting this name leads to praising Allah."
    },
    {
      "name": "ٱلْمُصْطَفَى",
      "count": 85,
      "desc_ur": "منتخب ہونے کا احساس پیدا کرتا ہے۔",
      "desc_en": "Instills a sense of being chosen."
    },
    {
      "name": "ٱلْمَاحِي",
      "count": 200,
      "desc_ur": "گناہوں کو مٹا دیتا ہے۔",
      "desc_en": "Erases sins."
    },
    {
      "name": "ٱلْحَاشِرُ",
      "count": 150,
      "desc_ur": "قیامت کی تیاری میں مدد کرتا ہے۔",
      "desc_en": "Helps prepare for the Day of Judgment."
    },
    {
      "name": "عَاقِب",
      "count": 110,
      "desc_ur": "انجام بخیر کا باعث بنتا ہے۔",
      "desc_en": "Ensures a good end."
    },
    {
      "name": "نَبِيُّ الرَّحْمَةِ",
      "count": 120,
      "desc_ur": "اللہ کی رحمت حاصل ہوتی ہے۔",
      "desc_en": "Attracts Allah's mercy."
    },
    {
      "name": "نَبِيُّ التَّوْبَةِ",
      "count": 130,
      "desc_ur": "توبہ کی توفیق ملتی ہے۔",
      "desc_en": "Encourages repentance."
    },
    {
      "name": "نَبِيُّ الْمَلْحَمَةِ",
      "count": 140,
      "desc_ur": "مشکلات کے خلاف مدد ملتی ہے۔",
      "desc_en": "Provides support against hardships."
    },
    {
      "name": "ٱلْأَمِينُ",
      "count": 125,
      "desc_ur": "اعتماد اور سچائی عطا کرتا ہے۔",
      "desc_en": "Grants trust and honesty."
    },
    {
      "name": "ٱلْمُجْتَبَى",
      "count": 115,
      "desc_ur": "منتخب ہونے کا احساس دلاتا ہے۔",
      "desc_en": "Makes one feel chosen."
    },
    {
      "name": "ٱلْمُرْسَلُ",
      "count": 105,
      "desc_ur": "اللہ کے پیغام کو سمجھنے میں مدد دیتا ہے۔",
      "desc_en": "Helps in understanding Allah's message."
    },
    {
      "name": "نَبِيُّ الْهُدَى",
      "count": 95,
      "desc_ur": "ہدایت کی روشنی عطا کرتا ہے۔",
      "desc_en": "Grants the light of guidance."
    },
    {
      "name": "نَبِيُّ الْمَوْعِظَةِ",
      "count": 100,
      "desc_ur": "نصیحت کو دل میں جگہ دیتا ہے۔",
      "desc_en": "Instills admonition in the heart."
    },
    {
      "name": "رَسُولُ الْمَلَاحِمِ",
      "count": 150,
      "desc_ur": "مشکل حالات میں مددگار ثابت ہوتا ہے۔",
      "desc_en": "Proves helpful in tough situations."
    },
    {
      "name": "ٱلْمُنير",
      "count": 140,
      "desc_ur": "روشنی فراہم کرتا ہے۔",
      "desc_en": "Provides illumination."
    },
    {
      "name": "ٱلشَّافِعُ",
      "count": 125,
      "desc_ur": "شفاعت کرنے والا۔",
      "desc_en": "The intercessor."
    },
    {
      "name": "ٱلْمُبَارَكُ",
      "count": 135,
      "desc_ur": "برکت عطا کرتا ہے۔",
      "desc_en": "Grants blessings."
    },
    {
      "name": "ٱلْمُعَلِّمُ",
      "count": 110,
      "desc_ur": "علم عطا کرتا ہے۔",
      "desc_en": "The teacher of knowledge."
    },
    {
      "name": "ٱلْوَفِيُّ",
      "count": 95,
      "desc_ur": "وفا کی علامت۔",
      "desc_en": "Symbol of loyalty."
    },
    {
      "name": "رَسُولُ الْحَقِّ",
      "count": 145,
      "desc_ur": "حق کے پیغام رساں۔",
      "desc_en": "Messenger of truth."
    },
    {
      "name": "ٱلْمُشَفَّعُ",
      "count": 155,
      "desc_ur": "شفاعت کی بشارت دینے والا۔",
      "desc_en": "Bearer of intercession's glad tidings."
    },
    {
      "name": "نَبِيُّ الْمَرْحَمَةِ",
      "count": 105,
      "desc_ur": "رحمت کی بشارت دینے والا۔",
      "desc_en": "Harbinger of mercy."
    },
    {
      "name": "رَسُولُ الرَّحْمَةِ",
      "count": 115,
      "desc_ur": "رحمت کا پیغام دینے والا۔",
      "desc_en": "Messenger of mercy."
    },
    {
      "name": "رَسُولُ التَّوْبَةِ",
      "count": 120,
      "desc_ur": "توبہ کا راستہ دکھانے والا۔",
      "desc_en": "Guide to repentance."
    },
    {
      "name": "رَسُولُ النَّجَاحِ",
      "count": 130,
      "desc_ur": "کامیابی کا پیغام دینے والا۔",
      "desc_en": "Messenger of success."
    },
    {
      "name": "رَسُولُ النُّورِ",
      "count": 140,
      "desc_ur": "روشنی کا پیغام دینے والا۔",
      "desc_en": "Bearer of light's message."
    },
    {
      "name": "حَبِيبُ اللهِ",
      "count": 180,
      "desc_ur": "اللہ کے محبوب۔",
      "desc_en": "Beloved of Allah."
    },
    {
      "name": "خَاتَمُ النَّبِيِّينَ",
      "count": 190,
      "desc_ur": "تمام انبیاء کے خاتم۔",
      "desc_en": "Seal of all Prophets."
    },
    {
      "name": "إِمَامُ الْمُرْسَلِينَ",
      "count": 160,
      "desc_ur": "تمام پیغمبروں کے امام۔",
      "desc_en": "Leader of all messengers."
    },
    {
      "name": "سَيِّدُ الْمُرْسَلِينَ",
      "count": 170,
      "desc_ur": "پیغمبروں کے سردار۔",
      "desc_en": "Master of the messengers."
    },
    {
      "name": "رَسُولُ الْمَلَاحِمِ",
      "count": 150,
      "desc_ur": "مشکلات میں رہنمائی کرنے والا۔",
      "desc_en": "Guide in times of difficulty."
    }
  ],
  "Darood" : [
    {
      "title_ur" : "درود کمالیه",
      "title_en" : "Darood Kamaliya",
      "name" : "اللَّهُمَّ صَلِّ وَسَلَّمْ وَبَارِكْ عَلَى سَيِّدِنَا مُحَمَّدِالنَّبِيِّ الْكَامِلِ وَعَلَى آلِهِ كَمَا لَا نِهَايَةً لِكَمَالِكَ وَعَدَدِ كَمَالِهِ",
      "desc_ur" : "اس درود پاک کو ایک مرتبہ پڑھنے سے چودہ ہزار درود پاک کا ثواب ملتا ہے",
      "desc_en" : "Reciting this Durood once brings the reward of fourteen thousand Durood recitations.",
      "count" : 1
  },
  {
      "title_ur": "درود ابراہیمی",
      "title_en": "Darood Ibrahimi",
      "name": "اللَّهُمَّ صَلَّ عَلَى مُحَمَّدٍ وَ عَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَ عَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ",
      "desc_ur": "جو مسلمان عرفہ کی شام موقف میں ٹھہرتا ہے، قبلہ شریف کی طرف منہ کر کے ، سو مرتبہ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ پڑھتا ہے ۔ پھر سو مرتبہ اللهُمَّ صَلِّ عَلَى مُحَمَّد الح درود پڑھتا ہے تو اللہ تعالیٰ فرماتا ہے اے میرے فرشتو! میرے اس بندے کی کیا جزا ہے جس نے میری تسبیح و تہلیل کی ، میری عظمت و تعریف بیان کی ، میری حمد وثنا کی ، میرے نبی پر درود بھیجا تم گواہ ہو جاؤ میں نے اسے بخش دیا، اس کی اس کے اپنے بارے، میں نے شفاعت قبول کر لی اگر یہ مجھ سے اہل موقف کی شفاعت کا سوال کرے تو اہل موقف کے بارے میں اس کی شفاعت قبول کرلوں گا",
      "desc_en": "The Muslim who stands in the Maqam of Arafah on the evening of Arafah, faces the Qibla, and recites 'La ilaha illallah wahdahu la sharika lahu lahul mulku walahul hamdu wahuwa ala kulli shay'in qadir' one hundred times, then recites 'Allahumma salli ala Muhammad' one hundred times, Allah says to His angels, 'What is the reward for my servant who has praised Me, declared My greatness, glorified Me, and sent blessings upon My Prophet?' Witness that I have forgiven him, accepted his intercession for himself, and if he asks for the intercession for the people of the Maqam, I will accept it for them too.",
      "count": 100
  },
    {
      "title_ur": "قصیدہ بردہ شریف",
      "title_en": "Qaseeda Burda Sharif",
      "name": "مَولايَ صَلِّ وَسَلِّمْ دَائِمًا أَبَدًا عَلَى حَبيبِكَ خَيْرِ الخَلْقِ كُلِّهِمْ محمد سَيِّدُ الكونينِ وَالتَّقَلَين وَالْفَرِيقَيْنِ مِنْ عُرْبٍ وَمِنْ عَجَمِ هو الحبيب الَّذِي تُرجُ شَفَاعَتُهُ لِكُلِّ هَوْلِ مِنَ الْأَهْوَالِ مُقْتَحِمْ يا اكرم الخَلْقِ مَالِي مَنْ الْوُذُ بِهُ سِوَاكَ عِنْدَ حُلُول الْحَادِثِ الْأُمَمِ  يَا رَبِّ بِالْمُصْطَفَى بَلِغْ مَقَاصِدَنَا وَاغْفِرْ لَنَا مَا مَضَى يَا بَارِي النَّسَمِ",
      "desc_ur": "قصیدہ بردہ شریف امام البصیری کی مشہور عربی نظم ہے جو نبی اکرم ﷺ کی تعریف اور محبت میں لکھی گئی ہے۔ اس قصیدہ میں نبی ﷺ کی شان اور فضیلت بیان کی گئی ہے۔",
      "desc_en": "The Qaseeda Burda Sharif is a famous Arabic poem by Imam al-Busiri, written in praise and love for Prophet Muhammad (ﷺ). It describes the virtues and esteemed status of the Prophet (ﷺ).",
      "count": 1
    },

    {
      "title_ur": "درود تنجينا",
      "title_en": "Darood Tunjina",
      "name": "اللهم صل على سيدنا محمد وعلى ال سيدنا محمد صلاةتنجينا بها من جميع الأقوالِ وَالآفَاتِ، وَتَقْطِين لَنَابها جميع الحاجات ، وتظهرُ نَا بِهَا مِن جميع الشَّيْئَاتِ وتَرْفَعُنَا بِهَا عِندَكَ أعلى الدرجاتِ، وَتُبْلَغْنَا بِهَا أَقصىالغايات من جميع الخيرَاتِ فِي الْحَيَاتِ وَبَعْدَ الْمَمَاتِإنك على كل شي قيده",
      "desc_ur": "یہ درود نبی کریم سایش ای ایم نے خواب میں حضرت شیخ صالح موسیٰ ریشمیہ کو ایسے وقت میں تلقین فرمایا جب ان کا جہاز طوفان میں گھرا تھا۔ شیخ صاحب خود فرماتے ہیں کہ جہاز ڈوبنے لگا۔ میں اس میں موجود تھا۔ اس وقت مجھ پر غنودگی سی طاری ہوئی ۔ اس حالت میں نبی کریم صلی یا کہ تم نے مجھے یہ درود سکھا کر حکم دیا کہ جہاز والے اس کو ہزار بار پڑھیں ابھی تین سو بار ہی پڑھا تھا کہ جہاز نے نجات پائی۔ جذب القلوب میں شیخ محمد عبدالحق محدث دہلوی ریلی علیہ فرماتے ہیں کہ اس درود کے پڑھنے سے سارے مقاصد دنیا و آخرت پورے ہوتے ہیں اور ساری مشکل مشکلیں آسان ہوتی ہیں ۔",
      "desc_en": "This Durood was taught to Sheikh Saleh Musa Rashmi in a dream by the Holy Prophet at a time when his ship was caught in a storm. Sheikh Rashmi himself says that the ship was about to sink and he was on it. At that time, he felt drowsy, and in that state, the Holy Prophet appeared and taught him this Durood, instructing that everyone on the ship recite it a thousand times. They had only recited it three hundred times when the ship was saved. Sheikh Muhammad Abdul Haq Muhaddith Dehlvi writes in Jazb al-Quloob that reciting this Durood fulfills all worldly and spiritual needs and makes all difficulties easy.",
      "count": 300
  },
  
  {
    "title_ur": "دُرُود تاج",
    "title_en": "Durood Taj",
    "name": "اَللّٰہُمَّ صَلِّ عَلٰی مُحَمَّدٍ صَاحِبِ التَّاجِ وَ الْمِعْرَاجِ وَ الْبُرَاقِ وَ الْعَلَمِ ط دَافِعِ الْبَلَآءِ وَ الْوَبَآءِ وَ الْقَحْطِ وَ الْمَرَضِ وَ الْاَلَمِ ط اِسْمُہٗ مَكْتُوْبٌ مَّرْفُوْعٌ مَّشْفُوْعٌ مَّنْقُوْشٌ فِی اللَّوْحِ وَ الْقَلَمِ ط سَیِّدِ الْعَرَبِ وَ الْعَجَمِ ط جِسْمُہٗ مُقَدَّسٌ مُّعَطَّرٌ مُّطَہَّرٌ مُّنَوَّرٌ فِی الْبَیْتِ وَ الْحَرَمِ ط شَمْسِ الضُّحٰی بَدْرِ الدُّجٰی صَدْرِ الْعُلٰی نُوْرِ الْہُدٰی کَہْفِ الْوَرٰی مِصْبَاحِ الظُّلَمِ ط جَمِیْلِ الشِّیَمِ ط شَفِیْعِ الْاُمَمِط صَاحِبِ الْجُوْدِ وَ الْکَرَمِط وَاللّٰہُ عَاصِمُہٗ وَ جِبْرِیْلُ خَادِمُہٗ وَ الْبُرَاقُ مَرْكَبُہٗ وَ الْمِعْرَاجُ سَفَرُہٗ وَ سِدْرَۃُ الْمُنْتَہٰی مَقَامُہٗ وَ قَابَ قَوْسَیْنِ مَطْلُوْبُہٗ وَ الْمَطْلُوْبُ مَقْصُوْدُہٗ وَ الْمَقْصَوْدُ مَوْجَوْدُہٗ سَیِّدِ الْمُرْسَلِیْنَ خَاتَمِ النَّبِیِّیْنَ شَفِیْعِ الْمُذْنِبِیْنَ اَنِیْسِ الْغَرِیْبِیْنَ رَحْمَۃٍ لِلْعٰلَمِیْنَ رَاحَۃِ الْعَاشِقِیْنَ مُرَادِ الْمُشْتَاقِیْنَ شَمْسِ الْعَارِفِیْنَ سِرَاجِ السَّالِکِیْنَ مِصْبَاحِ الْمُقَرَّبِیْنَ مُحِبِّ الْفُقَرَآءِ وَ الْغُرَبَآءِ وَ الْمَسَاکِیْنَ سَیِّدِ الثَّقَلَیْنِ نَبِیِّ الْحَرَمَیْنِ اِمَامِ الْقِبْلَتَیْنِ وَسِیْلَتِنَا فِیْ الدَّارَیْنِ صَاحِبِ قَابَ قَوْسَیْنِ مَحْبُوْبِ رَبِّ الْمَشْرِقَیْنِ وَ الْمَغْرِبَیْنِ جَدِّ الْحَسَنِ وَ الْحُسَیْنِ مَوْلَانَا وَ مَوْلَی الثَّقَلَیْنِ اَبِیْ الْقَاسِمِ مُحَمَّدِ بْنِ عَبْدِ اللّٰہِ نُوْرِ مِّنْ نُوْرِ اللّٰہِ ط یَآ یُّہَا الْمُشْتَاقُوْنَ بِنُوْرِ جَمَالِہٖ صَلُّوْا عَلَیْہِ وَ اٰلِہٖ وَ اَصْحَابِہٖ وَ سَلِّمُوْا تَسْلِیْمًا",
    "desc_ur": "جو شخص عروجِ ماہ (یعنی چاندکی پہلی سے چودھویں تک) شبِ جمعہ میں بعد نمازِ عشا باوضو پاک کپڑے پہن کر خوشبو لگاکر ایک سو ستر بار اس دُرُودِ پاک کو پڑھ کر سوئے، گیارہ شب متواتر (یعنی بلاناغہ) اسی طرح کرے، ان شاء اللہ حضورِ اکرم صلی اللہ علیہ واٰلہ وسلم کی زیارت سے مشرَّف ہو گا۔ (2) سحر و آسیب جن و شیطان کے دفع کیلئے اور چیچک کے لئے 11 بار پڑھ کر دم کرے، ان شاء اللہ فائدہ ہوگا۔ (3) قلب کی صفائی کے لئے ہر روز بعد نماز صبح ساٹھ بار اور بعد نماز عصر تین بار اور بعد نماز عشا تین بار ورد رکھے۔ (4) دشمنوں، ظالموں، حاسدوں اور حاکموں کے شر سے محفوظ رہنے کے لیے اور غم و غربت دور کرنے کے لئے چالیس شب متواتر (یعنی بلاناغہ) بعد نماز عشا 41 بار پڑھے۔ (5) روزی میں برکت کے لئے سات بار بعد نماز فجر ہمیشہ ورد رکھے۔ (6) اگر حاملہ پر خلل (یعنی تکلیف) ہو تو سات دن برابر سات مرتبہ پانی پر دم کرکے پلائے۔ (7) واسطے مواصلت طالب و مطلوب (جائز محبت مثلاً میاں بیوی میں محبت) اور ہر مقصود کے لیے آدھی رات کے بعد باوضو چالیس بار صدق و یقین کے ساتھ پڑھے، ان شاء اللہ مطلوب دلی حاصل ہوگا۔",
    "desc_en": " For the one who recites this Durood 170 times after Isha prayer during the first to the fourteenth night of the lunar month, and continues this practice for eleven consecutive nights, will be blessed with the vision of the Holy Prophet (صلى الله عليه وسلم). 2. To ward off harm from spirits, jinns, and for curing smallpox, recite 11 times and blow over the affected area. 3. For cleansing the heart, recite 60 times after Fajr, 3 times after Asr, and 3 times after Isha daily. 4. For protection from enemies, oppressors, and for relief from grief and poverty, recite 41 times after Isha for forty consecutive nights. 5. For blessings in sustenance, recite 7 times after Fajr regularly. 6. If a pregnant woman is experiencing complications, recite 7 times for seven consecutive days and give it to her in water. 7. For communication and achieving desires, recite 40 times with sincerity and faith after midnight, and Insha'Allah, your heartfelt desires will be fulfilled.",
    "count": 41
  },
  {
    "title_ur": "درود شفاء",
    "title_en": "Durood Shifa",
    "name": "اللَّهُمَّ صَلَّى وَسَلَّمْ وَبَارِكْ عَلَى سَيِّدِنَا وَمَوْلَانَا مُحَمَّدٍ طِبْ الْقُلُوبِ وَدَوَائِهَا وَعَافِيَةِ الْأَبْدَانِ وَشِفَائِهَا وَنُورِ الْأَبْصَارِ وَضِيَائِهَا وَالِهِ وَصَحْبِهِ دَائِمًا أَبَدًا",
    "desc_ur": "درود شفاء گیارہ بار پڑھ کر جس مریض پر دم کریں، شفاء ہو گی۔ پیٹ کے امراض میں پانی پر دم کر کے مریض کو پلائیں، اختناق الرحیم، بانی لوله و دمیر ریاتی امراض اور دردوں میں ہیرا جنگ پر دم کر کے کیوں برابر ایک چمچہ گرم پانی میں کھو کہ مریض کو پلائیں، ناک میں بھی دو قطرے ڈالیں فوراً ہوش آجائے۔",
    "desc_en": "Recite this Durood eleven times and blow over the patient for healing. For stomach ailments, blow over water and give it to the patient. For chest and heart-related issues, recite over water and give to the patient, and for immediate relief, put two drops in the nostrils.",
    "count": 11
  },
  {
    "title_ur": "درود خضری",
    "title_en": "Durood Khazri",
    "name": "صَلَّى اللهُ عَلَى حَبِيبِهِ سَيِّدِنَا مُحَمَّدٍ وَآلِهِ وَصَحْبِهِ وَسَلَّمْ",
    "desc_ur": "یہ درود پاک تمام درودوں میں اسم اعظم کا درجہ رکھتا ہے اور بارگاہ رسالت کا پسندیدہ ہے۔ اس درود شریف پڑھنے والے کی تربیت روح القدس سے ہوتی ہے یا اسے حضرت خضر کی تربیت میں دے دیا جاتا ہے، اس وجہ سے اسے درود خضری کہتے ہیں۔",
    "desc_en": "This Durood holds the highest status among all Duroods and is favored in the court of Prophethood. Reciting it leads to spiritual training either by the Holy Spirit or under the guidance of Hazrat Khidr, which is why it is called Durood Khazri.",
    "count": 1000
  },
  {
    "title_ur": "درود جمعہ",
    "title_en": "Durood Jumu'ah",
    "name": "اللَّهُمَّ صَلِّ وَسَلَّمْ وَبَارِكْ عَلَى سَيِّدِنَا مُحَمَّدِ النَّبِيِّ الْأُمِّي الْحَبِيبِ الْعَالِي الْقَدْرِ الْعَظِيمِ الْجَاهِ وَعَلَى آلِهِ وَصَحْبِهِ وَسَلِّمُ",
    "desc_ur": "حضرت انس بن مالک اور حضرت ابو ہریرہ کی روایت کے مطابق، جو شخص جمعہ کے دن عصر کی نماز کے بعد اپنی جگہ سے اٹھنے سے پہلے 80 مرتبہ یہ درود شریف پڑھے، اس کے اتنے سال کے گناہ معاف ہو جائیں گے اور اسی سال کی عبادت کا ثواب اس کے لیے لکھا جائے گا۔",
    "desc_en": "According to the narrations of Hazrat Anas bin Malik and Hazrat Abu Hurairah, whoever recites this Durood 80 times after the Friday prayer and before leaving their place, their sins for that year will be forgiven, and the reward for worship for that year will be recorded for them.",
    "count": 80
  },
  
  {
    "title_ur": "درود قرآنی",
    "title_en": "Durood Qurani",
    "name": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَالِهِ وَأَصْحَابِهِ بعدَدِ مَا فِي جَمِيعَ الْقُرْآنِ حَرْفًا حَرْفًا وَ بِعَنَا كُلِّ حَرْفٍ أَلْفًا أَلْفًا",
    "desc_ur": "قرآن مجید کی تلاوت کے بعد جو شخص اس درود پاک کو پڑھے گا اللہ تعالیٰ اسے دنیا و آخرت میں سرخرو فرمائے گا۔",
    "desc_en": "Whoever recites this Durood after the recitation of the Holy Quran, Allah will grant them success in this world and the Hereafter.",
    "count": 120
  },
  {
    "title_ur": "کشادگی رزق",
    "title_en": "Kushadgi Rizq",
    "name": "اللهُمَّ صَلِّ عَلَى مُحَمَّدٍ عَبْدِكَ وَرَسُولِكَ وَصَلِّ عَلَى الْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ وَ الْمُسْلِمِينَ وَالْمُسْلِمَاتِ",
    "desc_ur": "علامہ اسمعیل حقی فرماتے ہیں: جو شخص اس درود پاک کو پڑھے گا، اللہ تعالیٰ اس کے مال میں خیر و برکت عطا فرمائے گا۔",
    "desc_en": "According to Allama Ismail Haqi, reciting this Durood will bring blessings and increase wealth for the reciter.",
    "count": 100
  },
  
  
  {
    "title_ur": "دیدار سرکار دو عالم",
    "title_en": "Durood Deedar-e-Sarkar-e-Du-Aalam",
    "name": "اللهُمَّ صَلِّ وَسَلَّمَ وَبَارِكْ عَلَى سَيِّدِنَا مَوْلِينَا مُحَمَّدِهِ النَّبِيِّ الْأُمِّي الحبيب لْعَالِي الْقَدْرِ الْعَظِيمِ الْجَاهِ وَعَلَى الهِ وَصَحْبِهِ وَسَلَّم",
    "desc_ur": "جو شخص ہر جمعہ کی رات اس درود پاک کو با قاعدگی سے کم از کم ایک مرتبہ پڑھے گا موت کے وقت مصطفیٰ کریم صلی اللہ علیہ وآلہ وسلم کی زیارت نصیب ہوگی اور قبر میں داخل ہوتے وقت وہ دیکھے گا کہ حضور نبی کریم صلی اللہ علیہ وآلہ وسلم خود اپنے دست اقدس سے اسے قبر میں اتار رہے ہیں۔",
    "desc_en": "Whoever recites this Durood regularly at least once every Friday night will be granted the vision of the Prophet Muhammad (peace be upon him) at the time of death, and upon entering the grave, they will see that the Prophet (peace be upon him) himself is lowering them into the grave.",
    "count": 1
  },
  {
    "title_ur": "درود برائے حل المشكلات",
    "title_en": "Durood Baraye Hal-ul-Mushkilat",
    "name": "اللهُمَّ صَلِّ وَسَلَّمَ وَبَارِكْ عَلَى سَيِّدِنَا مُحَمدِ قَدْ ضَاقَتْ حِيلَتِي أَدْرِكْنِي يَا رَسُولَ اللَّهِ",
    "desc_ur": "سید ابن عابدین فرماتے ہیں کہ میں نے اس درود پاک کو ایک بہت بڑے فتنے میں جو دمشق میں واقع ہوا تھا دو سو مرتبہ پڑھا تھا کہ کسی شخص نے مجھے اطلاع دی کہ فتنہ ختم ہو گیا ہے۔",
    "desc_en": "Sayyid Ibn Abidin mentioned that after reciting this Durood two hundred times during a major trial in Damascus, he was informed that the trial had ended.",
    "count": 200
  },
  {
    "title_ur": "درود برائے شفاعت رسول",
    "title_en": "Durood Baraye Shafa'at-e-Rasool",
    "name": "اللهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ وَانْزِلُهُ الْمَقْعَدَ الْمُقَرَّبَ عِنْدَكَ يَوْمَ الْقِيمَةِ",
    "desc_ur": "حضور نبی رحمت صلی اللہ علیہ وآلہ وسلم نے فرمایا: جو شخص اس درود شریف کو پڑھے گا، اس کے لیے میری شفاعت یقینی ہوگی۔",
    "desc_en": "The Prophet Muhammad (peace be upon him) said: Whoever recites this Durood, my intercession for them will be guaranteed.",
    "count": 1
  },
  {
    "title_ur": "نیکیوں کی بہار",
    "title_en": "Spring of Good Deeds",
    "name": "جَزَى اللَّهُ تَعَالَى عَنَّا سَيِّدِنَا وَمَوْلَانَا مُحَمَّدًا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا هُوَ أَهْلُهُ",
    "desc_ur": "حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو شخص یہ درود پڑھے اس کے لیے ستر ہزار فرشتے ہزار دن تک استغفار کرتے ہیں۔",
    "desc_en": "It is narrated from Abdullah bin Abbas (ra) that the Prophet (peace be upon him) said: Whoever recites this Durood will have seventy thousand angels asking forgiveness for him for a thousand days.",
    "count": 1
  },
  
  {
    "title_ur": "گیارہ ہزار درودکے برابر ثواب",
    "title_en": "Equivalent to Eleven Thousand Duroods",
    "name": "اللهم صل على سيدنا محمد و على المصلوة انت لها اها و هو لها اهال",
    "desc_ur": "حافظ سیوطی ریشمیہ کا فرمان ہے کہ اس درود شریف کا ایک مرتبہ پڑھنا گیارہ ہزار مرتبہ پڑھنے کے برابر ہے۔",
    "desc_en": "According to Hafiz al-Suyuti, reciting this Durood once is equivalent to reciting it eleven thousand times.",
    "count": 1
  },
  {
    "title_ur": "منہ کی بد بو زائل کرنے کا نسخہ",
    "title_en": "Remedy for Bad Breath",
    "name": "اللَّهُمَّ صَلِّ وَسَلَّمْ عَلَى النَّبِيِّ الطَّاهِرِ",
    "desc_ur": "جو اس درود شریف کو بکثرت پڑھے گا، اللہ تعالیٰ اسے ظاہری و باطنی طہارت و پاکیزگی مرحمت فرمائے گا اور اس کے منہ کی بدبو بھی زائل ہو گی۔ ان شاء اللہ",
    "desc_en": "Whoever recites this Durood frequently, Allah will grant him both outward and inward purity and remove bad breath. Insha'Allah.",
    "count": 1
  },
  {
    "title_ur": "یادداشت کو مضبوط کرنے کے لیے",
    "title_en": "For Strengthening Memory",
    "name": "اللهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ عَلَى سَيِّدِنَا مُحَمَّدِ النَّبِيِّ الْكَامِلِ وَعَلَى آلِهِ كَمَا لَا نِهَايَةَ لِكَ مَالِكَوَعَدَدَ كَمَالِهِ",
    "desc_ur": "اگر کوئی شخص نسیان (بھول جانا) کے مرض میں مبتلا ہو تو مغرب اور عشاء کے درمیان اس درود پاک کو کثرت سے پڑھے، اس کا حافظہ قوی ہو جائے گا۔",
    "desc_en": "If someone suffers from forgetfulness, reciting this Durood frequently between Maghrib and Isha will strengthen his memory.",
    "count": 1
  },
  {
    "title_ur": "رحمت کے ستر دروازے کھلوانے کا درود",
    "title_en": "Durood for Opening Seventy Doors of Mercy",
    "name": "صَلَّى اللهُ عَلَى مُحَمَّدِه",
    "desc_ur": "جو خوش نصیب یہ درود پاک پڑھتا ہے، اس پر رحمت کے ستر دروازے کھول دیئے جاتے ہیں۔",
    "desc_en": "Whoever recites this Durood is blessed with the opening of seventy doors of mercy.",
    "count": 1
  }

  ],
  "Wazifa" : [
    {
      "name": "سُبْحَانَ اللَّهِ الْعَلِيِّ الْعَظِيمِ",
      "desc_ur": "اس کو 100 بار روزانہ پڑھنے سے برکت ہوگی۔ اس دعا کے کئی فضائل ہیں، جن میں سے چند ایک یہ ہیں:",
      "desc_en": "Reciting this 100 times daily will bring blessings. This prayer has several virtues, some of which are:",
      "count": 100,
      "benefits_ur": [
        "یہ دعا اللہ تعالیٰ کی تسبیح اور اس کی عظمت کا اظہار ہے۔",
        "یہ جملہ اللہ تعالیٰ کی قدرت اور حکمت کا اعتراف ہے۔",
        "یہ جملہ انسان کے ایمان کو مضبوط بناتا ہے۔"
      ],
      "benefits_en": [
        "This prayer is an expression of Allah's glorification and greatness.",
        "This phrase acknowledges Allah's power and wisdom.",
        "This phrase strengthens a person's faith."
      ]
    },
    {
      "name": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ",
      "desc_ur": "اس کو 100 بار روزانہ پڑھنے سے برکت ہوگی۔ اس دعا کے کئی فضائل ہیں، جن میں سے چند ایک یہ ہیں:",
      "desc_en": "Reciting this 100 times daily will bring blessings. This prayer has several virtues, some of which are:",
      "count": 100,
      "benefits_ur": [
        "یہ دعا اللہ تعالیٰ کی تسبیح اور اس کی عظمت کا اظہار ہے۔",
        "یہ دعا اللہ تعالیٰ سے مدد اور توفیق طلب کرنے کا ایک ذریعہ ہے۔",
        "یہ دعا انسان کو ہر قسم کی مشکلات اور مصائب سے بچانے کا ذریعہ ہے"
      ],
      "benefits_en": [
        "This prayer is an expression of Allah's glorification and greatness.",
        "This prayer is a means of seeking help and success from Allah.",
        "This prayer is a means of protection from all types of difficulties and adversities."
      ]
    },
    {
      "name": "سُبْحَانَ اللَّهِ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
      "desc_ur": "اس کو 200 بار روزانہ پڑھنے سے برکت ہوگی۔ اس دعا کے کئی فضائل ہیں، جن میں سے چند ایک یہ ہیں:",
      "desc_en": "Reciting this 200 times daily will bring blessings. This prayer has several virtues, some of which are:",
      "count": 200,
      "benefits_ur": [
        "یہ دعا انسان کو ہر قسم کی مشکلات اور مصائب سے بچانے کا ذریعہ ہے۔",
        "یہ دعا انسان کے رزق اور معیشت میں برکت کا باعث بنتی ہے۔",
        "یہ جملہ انسان کے ایمان کو مضبوط بناتا ہے۔"
      ],
      "benefits_en": [
        "This prayer is a means of protection from all types of difficulties and adversities.",
        "This prayer brings blessings to a person's sustenance and livelihood.",
        "This phrase strengthens a person's faith."
      ]
    },
    {
      "name": "یاعلیم",
      "desc_ur": "روزانہ فجر کی نمازکے بعد’’یاعلیم‘‘150مرتبہ پڑھ لیاکریں،اورامتحان کے روزاس کی کثرت کریں۔",
      "desc_en": "Recite 'Ya Aleem' 150 times daily after Fajr prayer and increase its recitation on the day of an exam.",
      "count": 150,
      "benefits_ur": [
        "’’یانَاصِرُ ‘‘ہرنمازکے بعداکیس مرتبہ پڑھیں۔",
        "امتحان میں کامیابی کے لیے امتحان کی مکمل تیاری کے ساتھ ساتھ دعاؤں کا اہتمام کریں ، کیوں کہ دعا سے بڑھ کر کوئی وظیفہ نہیں"
      ],
      "benefits_en": [
        "Recite 'Ya Nasser' 21 times after each prayer.",
        "For success in exams, make sure to prepare fully and also engage in prayers, as there is no practice greater than prayer."
      ]
    },
    {
      "name": "لا إلهَ إِلَّا اللهُ الْمَلِكُ الْحَقُّ الْمُبِينُ",
      "desc_ur": "جو دن میں 100 بار اللہ کے نبی صلی اللہ علیہ وسلم کا آخری قول",
      "desc_en": "Whoever recites 100 times daily the last saying of the Prophet (peace be upon him)",
      "count": 100,
      "benefits_ur": [
        "اسے محتاجی سے آمان ملے گی",
        "قبر کی وحشت دور ہوگی",
        "دولت اس کے پاس کھنچی چلی آئے گی",
        "حضرت علی کرم اللہ وجہ سے روایتی و شخص روزانہ سوم تبہ اس کا ورد کریگا اسکی روزی میں برکت ہوگی عذاب قبر سے بچا رہے گا ، موت کے وقت اس کی روح کے جنت میں داخلے کیلئے تمام دروازے کھل جائیں گے۔ یہ کلمہ روضہ انور صلی اللہ تعالیٰ علیہ آلہ وسلم کی جالی مبارک پر بھی لکھا گیا ہے ۔"
      ],
      "benefits_en": [
        "He will be protected from neediness.",
        "The horror of the grave will be removed.",
        "Wealth will be attracted to him.",
        "Whoever recites this regularly will have blessings in his sustenance, protection from the torment of the grave, and all doors to paradise will open for his soul at the time of death. This phrase is also written on the blessed grille of the Prophet's shrine."
      ]
    },
    {
      "name": "يَا مُؤَخِّرُ",
      "desc_ur": "روزانہ ایک سو مرتبہ سونے سے پہلے پڑھنے سے بچے نیک خصلت ہو جاتے ہیں،",
      "desc_en": "Reciting this 100 times daily before sleeping makes children virtuous.",
      "count": 100,
      "benefits_ur": [
        "دل میں سکون پیدا ہو گا برائیاں دور ہو جائیں گی۔",
        "اللہ تعالیٰ کی محبت پانے کی دعا",
        "اگر کوئی شخص اس اہم مبارک کا روزاند ایک سو مرتبہ پڑھے گا تو اسمیں ولیوں جیسی صفتیں پیدا ہوں گی اور اسہ تعالٰی اس کے تمام امور اپنے زار لے لیتا ہے، اور اس کے تار اور اپنےذمہ سے بہتا ہے، اور اسکے تمام مشکل کام انہ غیب آسان ہو جاتے ہیں۔"
      ],
      "benefits_en": [
        "It will bring peace to the heart and remove evils.",
        "A prayer for gaining Allah's love.",
        "If someone recites this 100 times daily, virtues similar to those of saints will develop, and Allah will take care of all his affairs. Difficult tasks will become easy, and he will be protected from various problems."
      ]
    },
    {
      "name": "يا مُقَدِّم",
      "desc_ur": "9 مرتبہ پڑھ کر میٹھی چیز پر دم کر کے کھلائے انشاء اللہ محبت پیدا ہو جائے گی",
      "desc_en": "Recite this 9 times and blow on a sweet item to create love, God willing.",
      "count": 9,
      "benefits_ur": [
        "محبت پیدا کرنے کے لیے",
        "میاں بیوی کے درمیان محبت یا کسی محرم رشتے کے لئے",
        "تنہائی میں ڈر لگتا ہو تو یا مقدم پڑھتا رہے ۔ بے خوف ہو گا اور ہر اذیت و بلا سے محفوظ ہے گا۔ اگر میدان جنگ ہو تو زخمی نہ ہوگا۔ دشمن پر فتح حاصل ہو گی ، ہنگامی حالات ہی نہ میں بھی اس کا درد بہت مفید ہے ۔"
      ],
      "benefits_en": [
        "For creating love.",
        "For love between spouses or any close relationship.",
        "If feeling fear in solitude, keep reciting this. It will remove fear and provide protection from harm. In times of war, one will not get wounded. It will also be very useful in emergencies."
      ]
    },
    {
      "name": "سُبْحَانَ اللهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ",
      "desc_ur": "پاک ہے سب تعریف اللہ کے لیے ہے اور نہیں کوئی معبود مگر اللہ، اللہ بہت بڑاہے۔",
      "desc_en": "Glory be to Allah, all praise is due to Allah, there is no deity but Allah, and Allah is the Greatest.",
      "count": 10,
      "benefits_ur": [
        "پھر رکوع میں جاؤ اور دس دفعہ یہی کلمات نہایت خشوع و خضوع کے ساتھ کہو۔ پھر رکوع سے سر اٹھاؤ اور قومہ میں بھی دس مرتبہ ان کلمات کو کہو، پھر سجدے میں جاؤ اور اس میں بھی یہی کلمات دس مرتبہ کہو،",
        "سجدے سے اٹھ کر جب جلسہ کے لیے بیٹھو تو یہی کلمات دس مرتبہ پڑھو، اب دوسرے سجدے میں جاؤ تو یہی کلمات دس مرتبہ کہو اور سجدے سے اٹھ کر جلسہ استراحت میں بھی یہی کلمات دس مرتبہ کہو، اب ایک رکعت ہوئی۔"
      ],
      "benefits_en": [
        "Go into Ruku and say these words ten times with utmost humility. Then rise from Ruku and say them ten times in Qoma, then go into Sajdah and say them ten times there,",
        "After rising from Sajdah and sitting in Jalsa, say these words ten times, then go into the second Sajdah and say them ten times, and after rising from Sajdah and sitting in Jalsa Istirahat, say them ten times. This completes one Rak'ah."
      ]
    },
    {
      "name": "وَلِلَّهِ مُلْكُ السَّمَوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا يَخْلُقُ مَا يَشَاءُ وَاللَّهُ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
      "desc_ur": "جو اولاد کی پیدائش سے نا امید ہو جائے سورۃ المائدہ کی آیت نمبر 17 کو 41 دن تک روزانہ 300 مرتبہ پڑھ کر کسی میٹھی چیز پر دم کر کے میاں بیوی آدھا آدھا کھا لیا کریں۔ انشاء اللہ ضرور امید پر آئے گی۔",
      "desc_en": "For those who have lost hope of having children, recite Surah Al-Ma'idah verse 17 three hundred times daily for 41 days and blow on a sweet item, then the husband and wife should each eat half. God willing, hope will be restored.",
      "count": 300,
      "benefits_ur": [
        "اولاد کی پیدائش سے نا اُمید ہو"
      ],
      "benefits_en": [
        "For those who have lost hope of having children."
      ]
    },
    {
      "name": "يَا غَنِي يَا مُغْنِي",
      "desc_ur": "صبح صبح دکان پر جا کر 50 مربہ پر سعی پڑھنے سے کاروبار میں بہت فائدہ ہو گا، انشاء اللہ",
      "desc_en": "Reciting 50 times early in the morning at the shop will bring great benefit to the business, God willing.",
      "count": 50,
      "benefits_ur": [
        "صبح سویرے دکان پر آنے والے گاہک کے لیے اور کاروبار میں برکت حاصل کریں۔",
        "یہ دعا اللہ تعالیٰ کی تسبیح اور اس کی عظمت کا اظہار ہے۔",
        "یہ دعا اللہ تعالیٰ سے مدد اور توفیق طلب کرنے کا ایک ذریعہ ہے۔"
      ],
      "benefits_en": [
        "Bring blessings to customers coming to the shop early in the morning and gain blessings in business.",
        "This prayer is an expression of Allah's glorification and greatness.",
        "This prayer is a means of seeking help and success from Allah."
      ]
    },
    {
      "name": "يَا لَطِيفُ يَا حَلِيمُ",
      "desc_ur": "اس کو 100 بار روزانہ پڑھنے سے  اللہ غیب سے رشتے کے اسباب بنا دے گا۔",
      "desc_en": "Reciting this 100 times daily will cause Allah to create reasons for relationships from the unseen.",
      "count": 100,
      "benefits_ur": [
        "رشتوں میں ہر قسم کی رکاوٹ دور کرنے کیلئے لا جواب عمل ہے۔",
        "اللہ غیب سے اچھے رشتے کے اسباب پیدا فرمادے گا۔ اور رشتوں میں ہر قسم کی رکاوٹ دور کرنے کیلئے لاجواب عمل ہے۔"
      ],
      "benefits_en": [
        "It is an excellent practice for removing all kinds of obstacles in relationships.",
        "Allah will create good reasons for relationships from the unseen, and it is an unparalleled practice for removing all kinds of obstacles in relationships."
      ]
    },
    {
      "name": "يَا بَاسِطُ يَا رَزَّاقُ",
      "desc_ur": "اگر کوئی رزق کی تنگی کا شکار ہو، ذریعہ آمدنی انتہائی محدود ہو تو وہ ہر روز نماز چاشت پڑھنے کے بعد ۱۰۰ مرتبہ اس وظیفہ کو پڑھ کر اللہ تعالی سے دعا مانگے۔ انشاء اللہ تعالی اس کے رزق میں کشادگی پیدا ہوگی۔ اللہ تعالی اس سے رزق کی تنگی دور فرمادے گا۔",
      "desc_en": "If someone is suffering from a lack of sustenance or has a very limited income, they should recite this supplication one hundred times daily after Chasht prayer and pray to Allah. God willing, their sustenance will increase, and Allah will remove their financial difficulties.",
      "count": 100,
      "benefits_ur": [
        "رزق میں اضافہ کیلئے وظیفہ",
        "رزق میں برکت اور قرض سے نجات کے لیے وظیفہ"
      ],
      "benefits_en": [
        "Supplication for increasing sustenance.",
        "Supplication for blessings in sustenance and relief from debt."
      ]
    },
    {
      "name": "اللهُمَّ أَنْتَ رَبِّي، لَا إِلَهَ إِلَّا أَنْتَ، عَلَيْكَ تَوَكَّلْتُ وَأَنْتَ رَبُّ الْعَرْشِ الْكَرِيمِ، مَا شَاءَ اللهُ كَانَ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ، لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ الْعَلِيِّ الْعَظِيمِ. أَعْلَمُ أَنَّ اللهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ وَأَنَّ اللهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا، اللهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ كُلِّ ذِي شَرٍّ، وَمِنْ شَرٍّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا. إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ",
      "desc_ur": "حضرت طلق فرماتے ہیں کہ ایک شخص حضرت ابو الدردار صحابی رضی اللہ عنہ کی خدمت میں حاضر ہوا اور عرض کیا کہ آپ کا مکان جل گیا، فرمایا نہیں جلا، پھر دوسرے شخص نے یہی اطلاع دی تو فرمایا نہیں جلا، پھر تیسرے آدمی نے یہی خبر دی آپ نے فرمایا نہیں جلا۔ پھر ایک اور شخص نے آکر کہا کہ اے ابو الدردار آگ کے شرارے بہت بلند ہوئے مگر جب آپکے مکان تک آگ پہنچی تو بجھ گئی فرمایا مجھے معلوم تھا کہ اللہ تعالیٰ ایسا نہیں کرے گا۔ (کہ میرا مکان جل جائے) کیونکہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے جو شخص صبح کے وقت یہ کلمات پڑھ لے شام تک اس کو کوئی مصیبت نہیں پہنچے گی",
      "desc_en": "Hazrat Talq narrates that a person came to the Sahabi Hazrat Abu Darda (RA) and said that your house has burned down. He replied, 'No, it has not.' The second person came and said the same, and he replied, 'No, it has not.' The third person came with the same news, and he replied, 'No, it has not.' Another person came and said that sparks had flown high but when they reached your house, the fire was extinguished. He said, 'I knew that Allah would not do this (burn my house) because I heard from the Messenger of Allah (PBUH) that whoever recites these words in the morning, no calamity will touch them until evening.'",
      "count": 1,
      "benefits_ur": [
        "حادثات سے بچنے کا وظیفہ"
      ],
      "benefits_en": [
        "Supplication for protection from accidents."
      ]
    },
    {
      "name": "يَا حَيُّ يَا قَيُّومُ إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ بِرَحْمَتِكَ اسْتَغِيثُ",
      "desc_ur": "313 بار صبح و شام پڑھیں۔ اول و آخر 7 مرتبہ درود شریف۔ زیادہ فائدے کیلئے روزانہ ہزاروں کی تعداد میں پڑھیں۔ مقصد کے حصول تک اس عمل کو جاری رکھیں۔ ہزاروں لوگوں کا آزمودہ ہے۔",
      "desc_en": "Recite this 313 times in the morning and evening. Begin and end with reciting Salawat seven times. For more benefits, recite it thousands of times daily. Continue this practice until the goal is achieved. Thousands have tested it successfully.",
      "count": 313,
      "benefits_ur": [
        "بندش، نظر بد، ٹونہ، جادو، جنات اور روحانی و جسمانی گھریلو الجھنوں کا آخری حل"
      ],
      "benefits_en": [
        "The ultimate solution for blockages, evil eye, spells, jinn, and both spiritual and physical household troubles."
      ]
    }

  ],
  "Tasbih" : [
    {
      "name": "سبحان الله",
      "desc_ur": "حضرت محمد ﷺ نے فرمایا: سبحان الله والْحَمْدُ للهِ وَلا إِلَهَ إِلَّا اللهُ وَ اللهُ أَكْبَرُ (سبحان الله 33 مرتبہ، الحمد لله 33 مرتبہ، لا إله إلا الله 33 مرتبہ، الله أكبر 33 مرتبہ)  یہ جملے جنت کے خزانوں میں سے ہیں۔ (ترمذي – حديث حسن صحيح)",
      "desc_en": "Prophet Muhammad (ﷺ) said: 'Subhan Allah, Alhamdulillah, La ilaha illallah, Allahu Akbar' (repeated 33 times each) - These phrases are from the treasures of Paradise. (Tirmidhi - Hadith Hasan Sahih)",
      "count": 33,
      "benefits_ur": "اللہ کی تسبیح کرنے سے دنیا اور آخرت میں فائدہ ملتا ہے، گمانوں اور وسوسوں سے نجات ملتی ہے، رزق میں برکت آتی ہے اور اللہ کی رضا حاصل ہوتی ہے۔",
      "benefits_en": "Saying Subhan Allah brings benefit in both this world and the hereafter, removes doubts and whispers, brings blessings to رزق (rizq - provision), and leads to Allah's pleasure."
    },
    {
      "name": "الحمد لله",
      "desc_ur": "حضرت ابو بكر رضي الله عنه نے فرمایا: سب سے بہتر ذکر ’الحمد لله’ ہے۔ (ابن ماجه – صحيح)",
      "desc_en": "Hazrat Abu Bakr (RA) said: The best ذکر (dhikr - remembrance) is 'Alhamdulillah'. (Ibn Majah - Sahih)",
      "count": 33,
      "benefits_ur": "اللہ کی حمد کرنے سے اللہ تعالیٰ کی نعمتوں کا شکر ادا ہوتا ہے، دل میں سکون پیدا ہوتا ہے اور اللہ کی رحمتوں کی توقع بڑھتی ہے۔",
      "benefits_en": "Saying Alhamdulillah expresses gratitude for Allah's blessings, brings peace to the heart, and increases hope for Allah's mercy."
    },
    {
      "name": "الله أكبر",
      "desc_ur": "حضرت علی رضي الله عنه  نے فرمایا: سب سے بلند اور عظیم ذکر ’الله أكبر’ ہے۔ (ترمذي – حديث حسن صحيح)",
      "desc_en": "Hazrat Ali (RA) said: The greatest and most magnificent dhikr is 'Allahu Akbar'. (Tirmidhi - Hadith Hasan Sahih)",
      "count": 34,
      "benefits_ur": "اللہ اکبر کہنے سے دل میں توحید مضبوط ہوتی ہے، مشکلات میں صبر عطا ہوتا ہے اور اللہ کا قرب حاصل ہوتا ہے۔",
      "benefits_en": "Saying Allahu Akbar strengthens Tawheed (belief in Allah's oneness) in the heart, grants patience in difficulties, and brings one closer to Allah."
    },
    {
      "name": "لا إله إلا الله",
      "desc_ur": "حضرت ابوذر غفاري رضي الله عنه  نے فرمایا: سب سے افضل کلمہ ’لا إله إلا الله’ ہے۔ (مسند احمد – حديث صحيح)",
      "desc_en": "Hazrat Abu Dharr al-Ghifari (RA) said: The most excellent word is 'La ilaha illallah'. (Musnad Ahmad - Hadith Sahih)",
      "count": 33,
      "benefits_ur": "لا الہ الا اللہ ایمان کی بنیاد ہے اس کا ورد کرنے سے ایمان مضبوط ہوتا ہے، گناہوں سے معافی ملتی ہے اور جنت میں داخلے کا سبب بنتا ہے۔",
      "benefits_en": "La ilaha illallah is the foundation of faith, and saying it strengthens إيمان (iman - faith), leads to forgiveness of sins, and paves the way for entering Paradise."
    },
    {
      "name": "أستغفر الله",
      "desc_ur": "حضرت محمد ﷺ نے فرمایا: أستغفر الله کہنے سے گناہوں کی معافی ملتی ہے۔ (مسلم)",
      "desc_en": "Prophet Muhammad (ﷺ) said: Saying 'Astaghfirullah' leads to the forgiveness of sins. (Muslim)",
      "count": 100,
      "benefits_ur": "أستغفر الله کہنے سے گناہوں کی معافی ملتی ہے اور دل کو سکون ملتا ہے۔",
      "benefits_en": "Saying Astaghfirullah results in the forgiveness of sins and brings peace to the heart."
    },
    {
      "name": "لا حول ولاقوة إلا بالله",
      "desc_ur": "حضرت محمد ﷺ نے فرمایا: لا حول ولاقوة إلا بالله کہنا جنت کے خزانوں میں سے ہے۔ (بخاری)",
      "desc_en": "Prophet Muhammad (ﷺ) said: Saying 'La hawla wa la quwwata illa billah' is from the treasures of Paradise. (Bukhari)",
      "count": 100,
      "benefits_ur": "لا حول ولاقوة إلا بالله کہنے سے مشکلات میں اللہ کی مدد حاصل ہوتی ہے اور ایمان مضبوط ہوتا ہے۔",
      "benefits_en": "Saying La hawla wa la quwwata illa billah brings Allah's help in difficulties and strengthens faith."
    },
    {
      "name": "سبحان الله وبحمده",
      "desc_ur": "حضرت محمد ﷺ نے فرمایا: جس نے سبحان الله وبحمده سو مرتبہ کہا، اس کے تمام گناہ معاف ہو جائیں گے۔ (بخاری)",
      "desc_en": "Prophet Muhammad (ﷺ) said: Whoever says 'SubhanAllah wa bihamdihi' one hundred times, all his sins will be forgiven. (Bukhari)",
      "count": 100,
      "benefits_ur": "سبحان الله وبحمده کہنے سے گناہوں کی معافی ملتی ہے اور نیکیاں بڑھتی ہیں۔",
      "benefits_en": "Saying SubhanAllah wa bihamdihi leads to the forgiveness of sins and increases good deeds."
    },
    {
      "name": "سبحان الله العظيم",
      "desc_ur": "حضرت محمد ﷺ نے فرمایا: سبحان الله العظيم کہنا میزان میں بھاری ہے۔ (ترمذی)",
      "desc_en": "Prophet Muhammad (ﷺ) said: Saying 'SubhanAllah al-Azim' is heavy on the scales. (Tirmidhi)",
      "count": 100,
      "benefits_ur": "سبحان الله العظيم کہنے سے نیکیاں بڑھتی ہیں اور میزان میں بھاری ہوتی ہیں۔",
      "benefits_en": "Saying SubhanAllah al-Azim increases good deeds and is heavy on the scales."
    },
    {
      "name": "أستغفر الله وأتوب إليه",
      "desc_ur": "حضرت محمد ﷺ نے فرمایا: جو شخص أستغفر الله وأتوب إليه کہتا ہے، اللہ اس کے تمام گناہ معاف کر دیتا ہے۔ (ترمذی)",
      "desc_en": "Prophet Muhammad (ﷺ) said: Whoever says 'Astaghfirullah wa atubu ilayh', Allah forgives all his sins. (Tirmidhi)",
      "count": 100,
      "benefits_ur": "أستغفر الله وأتوب إليه کہنے سے گناہوں کی معافی ملتی ہے اور اللہ کی رضا حاصل ہوتی ہے۔",
      "benefits_en": "Saying Astaghfirullah wa atubu ilayh results in the forgiveness of sins and earns Allah's pleasure."
    },
    {
      "name": "سبحان الله الحمد لله الله أكبر",
      "desc_ur": "حضرت محمد ﷺ نے فرمایا: سبحان الله، الحمد لله، الله أكبر، یہ کلمات میزان میں بھاری ہیں اور اللہ کے نزدیک محبوب ہیں۔ (مسلم)",
      "desc_en": "Prophet Muhammad (ﷺ) said: 'SubhanAllah, Alhamdulillah, Allahu Akbar', these words are heavy on the balance and dear to Allah. (Muslim)",
      "count": 33,
      "benefits_ur": "یہ کلمات اللہ کے نزدیک محبوب ہیں اور میزان میں بھاری ہیں۔ ان کو پڑھنے سے دل میں اللہ کی محبت بڑھتی ہے اور نیکیوں میں اضافہ ہوتا ہے۔",
      "benefits_en": "These words are dear to Allah and heavy on the scales. Reciting them increases love for Allah and enhances good deeds."
    },
    {
      "name": "سبحان الملك القدوس",
      "desc_ur": "حضرت محمد ﷺ نے فرمایا: سبحان الملك القدوس کہنا جنت کے درخت لگانے کے برابر ہے۔ (ترمذی)",
      "desc_en": "Prophet Muhammad (ﷺ) said: Saying 'Subhanal Malikil Quddus' is equivalent to planting trees in Paradise. (Tirmidhi)",
      "count": 100,
      "benefits_ur": "سبحان الملك القدوس کہنے سے جنت میں درخت لگتے ہیں اور اللہ کی رضا حاصل ہوتی ہے۔",
      "benefits_en": "Saying Subhanal Malikil Quddus results in planting trees in Paradise and earns Allah's pleasure."
    },
    {
      "name": "اللهم إني أسألك الجنة وأعوذ بك من النار",
      "desc_ur": "حضرت محمد ﷺ نے فرمایا: جو شخص اللهم إني أسألك الجنة وأعوذ بك من النار کہتا ہے، اللہ اسے جنت عطا فرماتا ہے اور جہنم سے بچاتا ہے۔ (ترمذی)",
      "desc_en": "Prophet Muhammad (ﷺ) said: Whoever says 'Allahumma inni as'aluka al-jannah wa a'udhu bika min an-nar', Allah grants him Paradise and saves him from the Fire. (Tirmidhi)",
      "count": 100,
      "benefits_ur": "اللهم إني أسألك الجنة وأعوذ بك من النار کہنے سے جنت کی دعا اور جہنم سے پناہ مانگی جاتی ہے۔",
      "benefits_en": "Saying Allahumma inni as'aluka al-jannah wa a'udhu bika min an-nar is a supplication for Paradise and seeking refuge from the Fire."
    },
    {
      "name": "اللهم أجرني من النار",
      "desc_ur": "حضرت محمد ﷺ نے فرمایا: اللهم أجرني من النار کہنا جہنم سے بچاؤ کا سبب بنتا ہے۔ (ابوداؤد)",
      "desc_en": "Prophet Muhammad (ﷺ) said: Saying 'Allahumma ajirni min an-nar' saves one from the Fire. (Abu Dawood)",
      "count": 100,
      "benefits_ur": "اللهم أجرني من النار کہنے سے جہنم سے بچاؤ ہوتا ہے اور اللہ کی پناہ حاصل ہوتی ہے۔",
      "benefits_en": "Saying Allahumma ajirni min an-nar protects one from the Fire and earns Allah's refuge."
    },
    {
      "name": "ربنا آتنا في الدنيا حسنة وفي الآخرة حسنة وقنا عذاب النار",
      "desc_ur": "قرآن میں ارشاد ہے: یہ دعا دنیا اور آخرت دونوں کی بھلائی مانگنے کے لیے ہے۔ (البقرہ: 201)",
      "desc_en": "The Quran states: This supplication asks for goodness in this world and the Hereafter. (Al-Baqarah: 201)",
      "count": 100,
      "benefits_ur": "یہ دعا دنیا اور آخرت کی بھلائی مانگنے کے لیے ہے، اس سے دنیا اور آخرت میں کامیابی حاصل ہوتی ہے۔",
      "benefits_en": "This supplication asks for goodness in both this world and the Hereafter, leading to success in both realms."
    },
    {
      "name": "حسبى الله لا إله إلا هو",
      "desc_ur": "قرآن میں ارشاد ہے: حسبى الله لا إله إلا هو کہنا اللہ کی کفایت پر اعتماد کا اظہار ہے۔ (التوبة: 129)",
      "desc_en": "The Quran states: Saying 'Hasbiyallahu la ilaha illa Huwa' expresses trust in Allah's sufficiency. (At-Tawbah: 129)",
      "count": 100,
      "benefits_ur": "حسبى الله لا إله إلا هو کہنے سے اللہ کی کفایت پر اعتماد کا اظہار ہوتا ہے اور دل کو سکون ملتا ہے۔",
      "benefits_en": "Saying Hasbiyallahu la ilaha illa Huwa expresses trust in Allah's sufficiency and brings peace to the heart."
    },
    {
      "name": "لا إله إلا أنت سبحانك إني كنت من الظالمين",
      "desc_ur": "حضرت یونس علیہ السلام نے مچھلی کے پیٹ میں یہ دعا کی تھی اور اللہ نے ان کی دعا قبول کی۔ (الانبیاء: 87)",
      "desc_en": "Prophet Yunus (AS) supplicated with this in the belly of the fish, and Allah accepted his supplication. (Al-Anbiya: 87)",
      "count": 100,
      "benefits_ur": "یہ دعا مشکلات سے نجات کے لیے پڑھی جاتی ہے اور اللہ کی مدد حاصل ہوتی ہے۔",
      "benefits_en": "This supplication is recited for relief from difficulties and to seek Allah's help."
    },
    {
      "name": "اللهم صل على محمد وعلى آل محمد",
      "desc_ur": "حضرت محمد ﷺ نے فرمایا: جو شخص مجھ پر درود بھیجتا ہے، اللہ اس پر دس رحمتیں نازل فرماتا ہے۔ (مسلم)",
      "desc_en": "Prophet Muhammad (ﷺ) said: Whoever sends blessings upon me, Allah sends ten mercies upon him. (Muslim)",
      "count": 100,
      "benefits_ur": "اللهم صل على محمد وعلى آل محمد کہنے سے اللہ کی رحمتیں نازل ہوتی ہیں اور گناہوں کی معافی ملتی ہے۔",
      "benefits_en": "Saying Allahumma salli ala Muhammadin wa ala ali Muhammad brings Allah's mercy and forgiveness of sins."
    },
    {
      "name": "يا حي يا قيوم برحمتك أستغيث",
      "desc_ur": "حضرت محمد ﷺ نے فرمایا: يا حي يا قيوم برحمتك أستغيث کہنا مشکلات میں اللہ کی مدد حاصل کرنے کے لیے ہے۔ (ترمذی)",
      "desc_en": "Prophet Muhammad (ﷺ) said: Saying 'Ya Hayyu Ya Qayyum, bi rahmatika astaghith' is for seeking Allah's help in difficulties. (Tirmidhi)",
      "count": 100,
      "benefits_ur": "يا حي يا قيوم برحمتك أستغيث کہنے سے مشکلات میں اللہ کی مدد حاصل ہوتی ہے اور ایمان مضبوط ہوتا ہے۔",
      "benefits_en": "Saying Ya Hayyu Ya Qayyum, bi rahmatika astaghith brings Allah's help in difficulties and strengthens faith."
    },
    {
      "name": "يا ذا الجلال و الإكرام",
      "desc_ur": "حضرت محمد ﷺ نے فرمایا: يا ذا الجلال و الإكرام کہنا اللہ کی بزرگی اور عظمت کا اعتراف ہے۔ (ترمذی)",
      "desc_en": "Prophet Muhammad (ﷺ) said: Saying 'Ya Dhal-Jalali wal-Ikram' acknowledges Allah's majesty and honor. (Tirmidhi)",
      "count": 100,
      "benefits_ur": "يا ذا الجلال و الإكرام کہنے سے اللہ کی بزرگی اور عظمت کا اعتراف ہوتا ہے اور اللہ کی رحمتیں حاصل ہوتی ہیں۔",
      "benefits_en": "Saying Ya Dhal-Jalali wal-Ikram acknowledges Allah's majesty and honor and brings His mercies."
    },
    {
      "name": "اللهم إني أسألك العافية",
      "desc_ur": "حضرت محمد ﷺ نے فرمایا: اللهم إني أسألك العافية کہنا دنیا اور آخرت کی بھلائی مانگنے کے لیے ہے۔ (ترمذی)",
      "desc_en": "Prophet Muhammad (ﷺ) said: Saying 'Allahumma inni as'aluka al-'afiyah' is for asking goodness in this world and the Hereafter. (Tirmidhi)",
      "count": 100,
      "benefits_ur": "اللهم إني أسألك العافية کہنے سے دنیا اور آخرت کی بھلائی حاصل ہوتی ہے اور مشکلات سے نجات ملتی ہے۔",
      "benefits_en": "Saying Allahumma inni as'aluka al-'afiyah brings goodness in this world and the Hereafter and relieves difficulties."
    }

  ],
  "Dua":[
    {
      "title_en": "Subhanaka",
      "title_ur":"سُبْحَانَكَ اللَّهُمَّ ",
      "name" : "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ  وَتَبَارَكَ اسْمُكَ  وَتَعَالَى جَدُّكَ  وَلاَ إِلَهَ غَيْرُكَ"
    },
    {
      "title_en": "Rabbenâ âtina",
      "title_ur":"رَبَّنَا آتِنَا",
      "name" : " رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ"
    },
    {
      "title_en": "Rabbenâğfirlî",
      "title_ur":"رَبَّنَا اغْفِرْ لِي",
      "name" : "رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ"
    },
    {
      "title_en": "Dua For Paradise",
      "title_ur":"جنت کے لیے دعا",
      "name" : "اللَّهُمَّ إِنِّي أَسْأَلُكَ رِضَاكَ وَالْجَنَّة، وَأَعُوْذُ بِكَ مِنْ سَخَطِكَ وَالنَّارِ"
    },
    {
      "title_en": "Dua After Namaz",
      "title_ur":"نماز کے بعد کی دعا",
      "name" : "اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ"
    },
    {
      "title_en":"Dua Namaz",
      "title_ur":"دعا کی نماز",
      "name" : "اللهم أنتَ السَّلامُ وَمِنْكَ السَّلَامُ تَبَارَكْتَ يَا ذَا الجلال والإكرام"
    }
  ],
  "Popular" : [
    {
      "name": "سبحان الله",
      "count" : 33
    },
    {
      "name": "لا حول ولاقوة إلا بالله",
      "count":100
    },
    {
      "name": "أستغفر الله",
      "count":33
    },
    {
      "name": "أستغفر الله",
      "count":33
    },
    {
      "name": "اللهم صل على محمد وعلى آل محمد",
      "count":100
    },
    {
      "name": "اللهم صل على محمد وعلى آل محمد",
      "count":100
    },
    {
      "name": "أستغفر الله وأتوب إليه",
      "count":100
    },
    {
      "name": "يَا مُؤَخِّرُ",
      "count":100
    },
    {
      "name": "سُبْحَانَ اللهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ",
      "count":10
    }

  ]
}